Revit 2026 API

# Transform2DBasisU Property

---

The image of (1, 0) under OfVector(UV).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV BasisU { get; set; }
```
```vb
Public Property BasisU As UV
	Get
	Set
```
```cpp
public:
property UV^ BasisU {
	UV^ get ();
	void set (UV^ value);
}
```
```fsharp
member BasisU : UV with get, set
```

#### Property Value

UV

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace